Trouvaille-2/stm32-/9-4 串口收发文本数据包/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "LED.h"
#include "Serial.h"
#include <String.h>

uint16_t RxData;
uint16_t Num;


int main(void)
{
    OLED_Init();       // 初始化OLED
		LED_Init();
		Serial_Init();
	
		OLED_ShowString(1,1,"TxPacket");
		OLED_ShowString(3,1,"RxPacket");

    while(1)
    {
			if(Serial_RxFlag==1)
			{
				OLED_ShowString(4,1,"          ");
				OLED_ShowString(4,1,Serial_RxPacket);
			
				if(strcmp(Serial_RxPacket,"LED_ON")==0)
				{
					LED1_ON();
					Serial_SendString("LED_ON_OK\r\n");
					OLED_ShowString(2,1,"          ");
					OLED_ShowString(2,1,"LED_ON_OK");
				}
					else if(strcmp(Serial_RxPacket,"LED_OFF")==0)
				{
					LED1_OFF();
					Serial_SendString("LED_OFF_OK\r\n");
					OLED_ShowString(2,1,"          ");
					OLED_ShowString(2,1,"LED_OFF_OK");
				}
				else 
				{
							Serial_SendString("ERROR_COMMAND\r\n");
						OLED_ShowString(2,1,"          ");
						OLED_ShowString(2,1,"ERROR_COMMAND");
					
				}
				
				Serial_RxFlag=0;
			}
    }
}